; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared1 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	Star10 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	Star11 - direction
	Star2 - direction
	Star9 - direction
	Star6 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star11)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star16)
)
(:goal (and
	(pointing satellite2 Star15)
	(have_image Star12 thermograph0)
	(have_image Planet13 thermograph0)
	(have_image Star14 infrared1)
	(have_image Star15 thermograph0)
	(have_image Star16 thermograph0)
	(have_image Star17 thermograph0)
	(have_image Phenomenon18 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 8
3. (turn_to satellite0 star12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star12)
   goals met: 0 of 8
4. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite0 planet13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet13)
   goals met: 1 of 8
6. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon18 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon18 instrument0 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 3 of 8
9. (turn_to satellite0 star14 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 star14)
   goals met: 3 of 8
10. (take_image satellite0 star14 instrument0 infrared1)
   added: (have_image star14 infrared1)
   goals met: 4 of 8
11. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 4 of 8
12. (take_image satellite0 star15 instrument0 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 5 of 8
13. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 5 of 8
14. (take_image satellite0 star16 instrument0 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 6 of 8
15. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 6 of 8
16. (take_image satellite0 star17 instrument0 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 7 of 8
17. (turn_to satellite2 star15 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star15)
   goals met: 8 of 8
